{
    "name": "How to Read this Section",
    "category": "hex:patterns",
    "icon": "minecraft:knowledge_book",
    "advancement": "hex:root",
    "priority": true,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "I've decided to put all the valid patterns I've discovered in this section of my notebook. $(br2)When I first began my studies, I believed I would have to go on quests to the dungeons and ancient libraries of the world to discover these. However, a strange force guides my hand calling herself the \"mod developer,\" raving the strangest things about how she \"wants to get the mod out already\" and \"is sick of handwriting JSON\" and \"wonders how many levels of fourth-wall breaking we're on, anyway.\""
        },
        {
            "type": "patchouli:text",
            "text": "She's probably a delusion brought on by staring at hexagons too often, but I guess the patterns do work.$(p)Anyways, I've divided the actions into sections based on what they do, more or less. I've written down the stroke order of the patterns as well, shown as a point moving along the pattern. I've marked the start of the pattern with a red dot.$(br2)If an action is cast by multiple patterns, as is the case with some simple actions, I'll write them all side-by-side."
        },
        {
            "type": "patchouli:text",
            "text": "I also write the types of iota that the action will consume or modify, a \"→\", and the types of iota the action will create.$(p)For example, \"$(n)vector, number/$ → $(n)vector/$\" means the action will remove a vector and a number from the top of the stack, and then add a vector; or, put another way, will remove a number from the stack, and then modify the vector at the top of the stack. (The number needs to be on the top of the stack, with the vector right below it.)"
	},
        {
            "type": "patchouli:text",
            "text": "\"→ $(n)entity/$\" means it'll just push an entity. \"$(n)entity, vector/$ →\" means it removes an entity and a vector, and doesn't push anything."
        }
    ]
}
