{
    "name": "Hexing 101",
    "category": "hex:casting",
    "icon": "hex:wand",
    "advancement": "hex:root",
    "priority": true,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "No wonder this art was lost to time! Casting _Hexes is quite difficult, so I'll have to re-read my notes carefully.$(br2)I start casting a _Hex by pressing $(k:use) with a $(item)Staff/$ in my hand. A hexagonal grid of points will spring in front of my eyes. Then, I can click and drag between those points to draw a pattern, releasing the button when I am through with a pattern."
        },  
        {
            "type": "patchouli:text",
            "text": "Once I'm done casting the spell, the grid will disappear as the _media I've bunched up is released. I can also press Escape if I want to quit early, if I don't mind a small mishap.$(br2)So what do I $(italic)do/$ with my staff? In short, there's a pipeline to follow:$(li)$(italic)Patterns/$ are matched to...$(li)$(italic)Actions/$, which manipulate...$(li)$(italic)The Stack/$, which consists of...$(li)$(italic)Iotas/$."
        },
        {
            "type": "patchouli:text",
            "text": "First, $(thing)patterns/$. As mentioned before, they're my means of interacting with and manipulating the _media around me. Certain patterns are associated with $(thing)actions/$. Actions are what actually $(italic)do/$ the magic; the _media is moved in particular ways by all patterns, and when it ends up doing something useful, we call it an action.$(br2)_Media is fickle; if I draw a pattern that is $(italic)not/$ a valid action, it usually causes a mishap."
        },
        {
            "type": "hex:pattern",
            "header": "An Example",
            "text": "It's interesting to note that the $(italic)direction/$ I draw a pattern in doesn't seem to matter at all. These two patterns both match to $(action)Mind's Reflection/$, for example.",
            "patterns": [{
                "startdir": "NORTH_EAST",
                "signature": "qaq"
            }, {
                "startdir": "EAST",
                "signature": "qaq",
                "q": 2
            }]
        },
        {
            "type": "patchouli:text",
            "text": "A _Hex is cast via a sequence of (valid) actions. Each action might do one of a few things:$(li)Gather some information about the environment.$(li)Do some kind of operation on the gathered data, mathematic or otherwise. (These actions are called \"spells.\")$(li)Perform some magical effect, like summoning lightning or an explosion.$(li)And of course, a magical mishap due to a mistake."
        },
        {
            "type": "patchouli:text",
            "text": "When I start casting a _Hex, it creates an empty stack. Actions do what they do via manipulating that stack.$(br2)For example, $(l:patterns/basic#OpGetCaster)$(action)Mind's Reflection/$ will push a reference to $(italic)me/$, the caster, onto the stack. $(l:patterns/basic#OpentityPos)$(action)Compass Purification/$ will pop an entity reference and push its location.$(br2)So, casting them in that order would result in my position on the stack."
        },
        {
            "type": "patchouli:text",
            "text": "In many ways, it reminds me of the spells cast by the practitioners of the $(thing)Psionic/$ arts during the 1.12 Renaissance, headed by a certain master of mathematics and railguns. $(br2)If I find I am not quite sure what a stack is, I might want to read $(l:casting/stack)this entry on the subject$(/l)."
        },
        {
            "type": "patchouli:text",
            "text": "Those pieces of information, like me and my position, are called $(thing)Iotas/$. There are several different types:$(li)Number (which some legends call a \"double\")$(li)Vector, a collection of three numbers representing a position, movement, or direction in the world$(li)Entity, like me or an animal$(li)Influence, a peculiar type that seems to represent various abstract ideas$(li)A pattern itself, used for crafting magic items and truly mind-boggling feats like $(italic)spells that cast other spells/$$(li)And a list of any of the above."
        },
        {
            "type": "patchouli:text",
            "text": "Of course, there's no such thing as a free lunch. All spells, and certain other actions, require _media as payment.$(br2)The best I can figure, a _Hex is a little bit like a plan of action presented to Nature. The _media is used to provide the arguments to back it up, so Nature will accept your plan and carry it out."
        },
        {
            "type": "patchouli:text",
            "text": "That aside, it doesn't seem like anyone has done much research on exactly how $(italic)much/$ any particular piece of amethyst is valued. The best I can tell, an $(item)Amethyst Shard/$ is worth about five $(item)Amethyst Dusts/$, and a $(item)Charged Amethyst Crystal/$ is worth about ten $(item)Amethyst Dusts/$.$(br2)Strangely enough, it seems like no other form of amethyst is suitable to be used in the casting of a _Hex. I suspect that whole blocks or crystals are too solid to be easily unraveled into _media."
        },
        {
            "type": "patchouli:text",
            "text": "It's worth noting that each action will consume the _media it needs individually, not all at once when the Hex finishes. Also, an action will always consume entire items. An action that only requires one $(item)Amethyst Dust/$'s worth of _media will consume an entire $(item)Charged Amethyst Crystal/$, if that's all that's present in my inventory.$(br2)So, it might be salient to $(italic)not/$ always use a Fortune pick when mining crystals so as not to waste _media..."
        },
        {
            "type": "patchouli:text",
            "text": "I should also be careful to make sure I actually have enough Amethyst in my inventory. It seems Nature is $(italic)more/$ than happy to use my own mind as payment for a spell. The feeling is described as awful but strangely euphoric, an effervescent dissolution into light and energy... Perhaps this is why all the old practitioners of the art went mad. I can't imagine a constant abrading of one's mind is healthy.$(br2)In any case, I estimate my health at its prime can be converted into approximately one $(item)Charged Amethyst Crystal/$'s worth of mana before I die."
        },
        {
            "type": "patchouli:link",
            "text": "I have also found an amusing tidbit on why so many practitioners of magic in general seem to go mad, which I may like as some light and flavorful reading not canonical to my world.$(br2)$(italic)Content Warning: some body horror and suggestive elements./$",
            "link_text": "Read it Here",
            "url": "https://goblinpunch.blogspot.com/2014/05/a-digression-about-wizards.html"
        }
    ]
}
